### YamlMime:Yaml
ms.openlocfilehash: 22e0f66b0180deb5d82960ab483d4d1086479493
ms.sourcegitcommit: d03bdc7fe5447adb6530886aab848b75fe8fa8ee
ms.translationtype: MT
ms.contentlocale: ko-KR
ms.lasthandoff: 03/11/2022
ms.locfileid: "139905359"
Slug: ml-powered-detections-with-kusto-query-language-in-azure-sentinel
Title: Azure Sentinel에서 Kusto 쿼리 언어로 전원이 공급되는 검색 Machine Learning
Summary: 사이버 공격이 점점 더 복잡하고 탐지하기 어려워짐에 따라 SIEM의 기존 상관 관계 규칙만으로는 충분하지 않으며, 공격의 전체 컨텍스트가 부족하며 이전에 본 공격만 탐지할 수 있습니다. 이로 인해 환경에서 거짓 부정 및 간격이 발생할 수 있습니다. 또한 상관 관계 규칙은 고객 환경에 따라 다른 결과를 제공할 수 있으므로 상당한 유지 관리 및 사용자 지정이 필요합니다.
Content: >-
  <p><em>이 게시물은 수석 보안 엔지니어링 관리자인 팀 버렐과 수석 소프트웨어 엔지니어인 도탄 파트리치(Dotan Patrich)가 공동 저술했습니다. </em></p>


  <p>사이버 공격이 점점 더 복잡하고 탐지하기 어려워짐에 따라 SIEM의 기존 상관 관계 규칙만으로는 충분하지 않으며, 공격의 전체 컨텍스트가 부족하며 이전에 본 공격만 탐지할 수 있습니다. 이로 인해 환경에서 거짓 부정 및 간격이 발생할 수 있습니다. 또한 상관 관계 규칙은 고객 환경에 따라 다른 결과를 제공할 수 있으므로 상당한 유지 관리 및 사용자 지정이 필요합니다.</p>


  <p>Azure Sentinel에 기본 제공되는 고급 Machine Learning 기능은 위협의 표시 동작을 감지하고 보안 분석가가 엔터프라이즈에서 예상되는 동작을 학습하는 데 도움이 됩니다. 또한 Azure Sentinel은 방화벽 데이터의 비정상적인 트래픽, 의심스러운 인증 패턴 및 리소스 생성 이상과 같은 의심스러운 동작을 검색할 수 있는 <a href="https://docs.microsoft.com/en-us/azure/kusto/query/">Kusto 쿼리 언어</a>의 Machine Learning 기능을 활용하는 기본 검색 쿼리를 제공합니다. 쿼리는 <a href="https://github.com/Azure/Azure-Sentinel">Azure Sentinel GitHub 커뮤니티</a>에서 찾을 수 있습니다.</p>


  <p>아래에서 환경을 보호하기 위해 기본 제공된 Machine Learning 기능을 활용하는 검색에 대한 세 가지 예를 찾을 수 있습니다.</p>


  <h2>비정상적으로 많은 수의 위치에서 사용자 계정 인증의 시계열 분석</h2>


  <p>일반적인 조직에는 인증에 Azure Active Directory 사용하는 많은 사용자와 많은 애플리케이션이 있을 수 있습니다. 일부 애플리케이션(예: Office365 Exchange Online)은 다른 응용 프로그램(예: Visual Studio)보다 더 많은 인증을 가질 수 있으므로 데이터를 지배합니다. 사용자는 애플리케이션에 따라 다른 위치 프로필을 가질 수도 있습니다. 예를 들어 전자 메일 액세스에 대한 높은 위치 가변성이 예상될 수 있지만 Visual Studio 인증과 관련된 개발 활동에서는 덜 필요할 수 있습니다. 모든 사용자/애플리케이션 조합에 대한 위치 가변성을 추적한 다음 가장 특이한 사례 중 일부만 조사하는 기능은 연산자 <a href="https://docs.microsoft.com/en-us/azure/kusto/query/make-seriesoperator">메이크 시리즈</a> 및 <a href="https://docs.microsoft.com/en-us/azure/kusto/query/series-fit-linefunction">series_fit_line</a> 사용하여 기본 제공 쿼리 기능을 활용하여 달성할 수 있습니다.</p>


  <pre>

  SigninLogs

  | where TimeGenerated &gt;= ago(30d)

  | extend  locationString= strcat(tostring(LocationDetails[&quot;countryOrRegion&quot;]), &quot;/&quot;, tostring(LocationDetails[&quot;state&quot;]), &quot;/&quot;, tostring(LocationDetails[&quot;city&quot;]), &quot;;&quot;)

  | project TimeGenerated, AppDisplayName , UserPrincipalName, locationString

  | make-series dLocationCount = dcount(locationString) on TimeGenerated in range(startofday(ago(30d)),now(), 1d)

  by UserPrincipalName, AppDisplayName

  | extend (RSquare,Slope,Variance,RVariance,Interception,LineFit)=series_fit_line(dLocationCount)

  | where Slope &gt;0.3</pre>


  <p><a href="https://azurecomcdn.azureedge.net/mediahandler/acomblog/media/Default/blog/c8436a92-e917-475a-9e2a-9281e3214379.png"><img alt="image" border="0" height="280" src="https://azurecomcdn.azureedge.net/mediahandler/acomblog/media/Default/blog/07765e85-07ed-4dc7-b521-fc1bfb2fea88.png" style="border: 0px currentcolor; border-image: none; margin-right: auto; margin-left: auto; float: none; display: block; background-image: none;" title="이미지" width="381"></a></p>


  <h2>비정상적인 수의 리소스 만들기</h2>


  <p>Azure에서 리소스를 만드는 것은 환경에서 정상적인 작업입니다. 운영 및 IT 팀은 조직의 요구 사항 및 요구 사항에 따라 환경 및 리소스를 자주 스핀업합니다. 그러나 권한이 없거나 이러한 리소스를 만들지 않는&rsquo; 사용자가&rsquo; 리소스를 비정상적으로 만드는 것은 매우 흥미롭습니다. Azure 활동 로그에서 비정상적인 리소스 생성 또는 의심스러운 배포 활동을 추적하면 공격자가 수행하는 실행 기술을 발견할 수 있습니다.</p>


  <pre>

  AzureActivity

  | where TimeGenerated &gt;= ago(30d)

  | where OperationName == &quot;Create or Update Virtual Machine&quot; or OperationName == &quot;Create Deployment&quot;

  | where ActivityStatus == &quot;Succeeded&quot;

  | make-series num = dcount(ResourceId)  default=0 on EventSubmissionTimestamp in range(ago(30d), now(), 1d) by Caller

  | extend  outliers=series_outliers(num, &quot;ctukey&quot;, 0, 10, 90)

  | project-away num

  | mvexpand outliers

  | where outliers &gt; 0.9

  | summarize by Caller</pre>


  <h4><a href="https://azurecomcdn.azureedge.net/mediahandler/acomblog/media/Default/blog/43d86bd2-bb04-4054-a18d-b9dd48f11b31.png"><img alt="image" border="0" height="320" src="https://azurecomcdn.azureedge.net/mediahandler/acomblog/media/Default/blog/1f05714c-01e8-4d65-b097-741cbbd17b2c.png" style="border: 0px currentcolor; border-image: none; margin-right: auto; margin-left: auto; float: none; display: block; background-image: none;" title="이미지" width="516"></a></h4>


  <h2>방화벽 트래픽 변칙</h2>


  <p>방화벽 트래픽은 조직의 잠재적 공격을 나타내는 추가 지표가 될 수 있습니다. 주별 또는 시간 단위로 일반적인 방화벽 트래픽 동작을 나타내는 기준을 설정하는 기능은 비정상적인 트래픽 증가를 지적하는 데 도움이 될 수 있습니다. Log Analytics 쿼리 언어에서 기본 제공 기능을 사용하면 트래픽 변칙을 직접 가리키고 조사할 수 있습니다.</p>


  <pre>

  CommonSecurityLog

  | summarize count() by bin(TimeGenerated, 1h)</pre>


  <p><a href="https://azurecomcdn.azureedge.net/mediahandler/acomblog/media/Default/blog/e4163a9f-58bc-43d5-b4cb-df2e9089c768.png"><img alt="image" border="0" height="354" src="https://azurecomcdn.azureedge.net/mediahandler/acomblog/media/Default/blog/dcd0e37f-5aab-49b1-9b1f-e753b08a9180.png" style="border-image: none; margin-right: auto; margin-left: auto; float: none; display: block; background-image: none;" title="이미지" width="624"></a></p>


  <p><a href="https://azure.microsoft.com/en-us/services/azure-sentinel/">Azure Sentinel</a>을 사용하면 <a href="https://docs.microsoft.com/en-us/azure/sentinel/tutorial-detect-threats">위의 고급 검색 규칙을 만들어</a> 사용자 환경에서 변칙 및 의심스러운 활동을 검색하거나, 사용자 고유의 검색 규칙을 만들거나, Microsoft 보안 연구원이 작성한 검색을 포함하는 풍부한 <a href="https://github.com/Azure/Azure-Sentinel/tree/master/Detections">GitHub 라이브러리</a>를 활용할 수 있습니다.</p>
